In [1]:
import pandas as pd

In [47]:
print pd.__version__

0.19.2

### Задание 1.1

In [73]:
df = pd.read_csv('data.csv',sep=';',index_col = 'PassengerId')

### Задание 1.2

In [78]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
...,...,...,...,...,...,...,...,...,...,...,...
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Задание 1.3

In [104]:
df.Age[-3:]

PassengerId
889     NaN
890    26.0
891    32.0
Name: Age, dtype: float64

### Задание 1.4

In [113]:
print df['Survived'].mean()*100

38.3838383838

### Задание 1.5

In [114]:
df.sort_values('Name')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.50,NaN,S
869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.50,NaN,S

### Задание 1.6

In [116]:
df['Sex'].value_counts(dropna=False,normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

### Задание 2.1

In [117]:
df['Sex'].value_counts(dropna=False,normalize=True)*100

male      64.758698
female    35.241302
Name: Sex, dtype: float64

### Задание 2.3

In [118]:
df.replace({"Pclass" : {1: 'Upper' , 2: 'Middle', 3:"Lower"} })

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
...,...,...,...,...,...,...,...,...,...,...,...
890,1,Upper,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,Lower,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Задание 2.4

In [119]:
df.groupby(['Sex']).Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

### Задание 2.5

In [120]:
df.isnull().sum().sum()

866

### Заданеи 3.1

In [121]:
df["Surname"]=df.Name.apply(lambda x: x.split(",")[0])
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
...,...,...,...,...,...,...,...,...,...,...,...,...
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley

### Задание 3.3

In [122]:
nvl = df.isnull().any()
for k in nvl.loc[lambda x : x==True].index:
    print k

Age
Cabin
Embarked